In [1]:
#dependencies

import pandas as pd

In [2]:
#Use Pandas to read data
avocado_sales_2017 = pd.read_csv("../Resources/clean_avocado.csv")

In [3]:
#print to view
avocado_sales_2017.head()

,Unnamed: 0,Date,AveragePrice,Total Volume,4046,4225,4770,Total Bags,Small Bags,Large Bags,XLarge Bags,type,year,region
0,0,1/4/2015,1.22,40873.28,2819.50,28287.42,49.90,9716.46,9186.93,529.53,0.0,conventional,2015,Albany
1,1,1/11/2015,1.24,41195.08,1002.85,31640.34,127.12,8424.77,8036.04,388.73,0.0,conventional,2015,Albany
2,2,1/18/2015,1.17,44511.28,914.14,31540.32,135.77,11921.05,11651.09,269.96,0.0,conventional,2015,Albany
3,3,1/25/2015,1.06,45147.50,941.38,33196.16,164.14,10845.82,10103.35,742.47,0.0,conventional,2015,Albany
4,4,2/1/2015,0.99,70873.60,1353.90,60017.20,179.32,9323.18,9170.82,152.36,0.0,conventional,2015,Albany

In [4]:
#look for missing values
#awesome to see!
avocado_sales_2017.count()

Unnamed: 0      18722
Date            18722
AveragePrice    18722
Total Volume    18722
4046            18722
4225            18722
4770            18722
Total Bags      18722
Small Bags      18722
Large Bags      18722
XLarge Bags     18722
type            18722
year            18722
region          18722
dtype: int64

In [5]:
#get a list of all of our columns for easy reference
avocado_sales_2017.columns

Index(['Unnamed: 0', 'Date', 'AveragePrice', 'Total Volume', '4046', '4225',
       '4770', 'Total Bags', 'Small Bags', 'Large Bags', 'XLarge Bags', 'type',
       'year', 'region'],
      dtype='object')

In [7]:
#collect data that includes year 2017 - all cities
#'year' == 2017

avocado_sales_2017_df = avocado_sales_2017.loc[(avocado_sales_2017["year"] == 2017)]

In [8]:
#print
avocado_sales_2017_df

,Unnamed: 0,Date,AveragePrice,Total Volume,4046,4225,4770,Total Bags,Small Bags,Large Bags,XLarge Bags,type,year,region
104,104,1/2/2017,1.47,129948.23,4845.77,117027.41,200.36,7874.69,7866.86,7.83,0.00,conventional,2017,Albany
105,105,1/8/2017,1.55,91728.18,3355.47,75641.23,56.91,12674.57,12606.67,67.90,0.00,conventional,2017,Albany
106,106,1/15/2017,1.55,88526.26,3327.65,71956.77,607.03,12634.81,12574.72,60.09,0.00,conventional,2017,Albany
107,107,1/22/2017,1.59,128679.24,4119.94,111173.08,2191.71,11194.51,11060.19,125.50,8.82,conventional,2017,Albany
108,108,1/29/2017,1.31,95424.59,3844.62,78315.15,484.56,12780.26,12393.84,382.06,4.36,conventional,2017,Albany
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
18620,26463,11/26/2017,1.58,5007.93,46.18,383.97,0.00,4577.78,4567.78,10.00,0.00,organic,2017,Tampa
18621,26464,12/3/2017,1.61,4677.74,40.64,534.88,0.00,4102.22,4091.12,11.10,0.00,organic,2017,Tampa
18622,26465,12/10/2017,1.56,5580.67,27.66,438.56,0.00,5114.45,5111.12,3.33,0.00,organic,2017,Tampa
18623,26466,12/17/2017,1.58,5609.58,65.61,564.27,0.00,4979.70,4912.21,67.49,0.00,organic,2017,Tampa
18624,26467,12/24/2017,1.64,7369.95,107.68,672.37,0.00,6589.90,5882.22,707.68,0.00,organic,2017,Tampa

In [9]:
#drop column "Unnamed: 0"
#add at end inplace=True -> to allow panda to edit the original DF
avocado_sales_2017_df.drop(columns=["Unnamed: 0"], inplace=True)

In [10]:
#print to view
avocado_sales_2017_df

,Date,AveragePrice,Total Volume,4046,4225,4770,Total Bags,Small Bags,Large Bags,XLarge Bags,type,year,region
104,1/2/2017,1.47,129948.23,4845.77,117027.41,200.36,7874.69,7866.86,7.83,0.00,conventional,2017,Albany
105,1/8/2017,1.55,91728.18,3355.47,75641.23,56.91,12674.57,12606.67,67.90,0.00,conventional,2017,Albany
106,1/15/2017,1.55,88526.26,3327.65,71956.77,607.03,12634.81,12574.72,60.09,0.00,conventional,2017,Albany
107,1/22/2017,1.59,128679.24,4119.94,111173.08,2191.71,11194.51,11060.19,125.50,8.82,conventional,2017,Albany
108,1/29/2017,1.31,95424.59,3844.62,78315.15,484.56,12780.26,12393.84,382.06,4.36,conventional,2017,Albany
...,...,...,...,...,...,...,...,...,...,...,...,...,...
18620,11/26/2017,1.58,5007.93,46.18,383.97,0.00,4577.78,4567.78,10.00,0.00,organic,2017,Tampa
18621,12/3/2017,1.61,4677.74,40.64,534.88,0.00,4102.22,4091.12,11.10,0.00,organic,2017,Tampa
18622,12/10/2017,1.56,5580.67,27.66,438.56,0.00,5114.45,5111.12,3.33,0.00,organic,2017,Tampa
18623,12/17/2017,1.58,5609.58,65.61,564.27,0.00,4979.70,4912.21,67.49,0.00,organic,2017,Tampa
18624,12/24/2017,1.64,7369.95,107.68,672.37,0.00,6589.90,5882.22,707.68,0.00,organic,2017,Tampa

In [11]:
#export DF into a .csv
avocado_sales_2017_df.to_csv("avocado_sales_2017.csv")